<script lang="ts">    
    let image = "/TM BLACK LOGO_page-0001.jpg";
</script>

<div class="h-auto bg-white">
    <div class="container mx-auto px-4 md:px-6 pt-32 pb-20 animate-fade-in">
        <div class="max-w-3xl mx-auto">
            <h1 class="text-4xl font-mono tracking-wider text-neutral-800 mb-24">
                PHILOSOPHY
            </h1>
            <div class="flex flex-col gap-8">
                <div class="flex flex-col gap-6 text-neutral-700 leading-relaxed text-base">
                    <p class="font-medium">
                        Δήλωση Αποστολής
                    </p>
                    <p>
                        Είμαστε μια εταιρεία που ξεχωρίζει στην παραγωγή specialty καφέδων και στην ανάπτυξη franchising coffee & bakery shops , βασιζόμενοι στη δημιουργικότητα και την εξατομικευμένη προσέγγιση. Μέσα από το μοναδικό μας concept "tailor-made", προσφέρουμε ροφήματα και συνταγές υψηλής ποιότητας, που διακρίνονται για την πρωτοτυπία και την ανεπανάληπτη γευστική τους εμπειρία.
                    </p>
                    <p>
                        Δίνοντας έμφαση σε ένα εξειδικευμένο μενού με specialty, φρεσκοκαβουρντισμένους καφέδες μοναδικής προέλευσης, συνδυάζουμε την τελευταία λέξη της τεχνολογίας στον χώρο του καφέ με τη συνεχή δημιουργικότητα και το σεβασμό στις ιδιαίτερες γευστικές προτιμήσεις των πελατών μας. Δεσμευόμαστε να καινοτομούμε διαρκώς, μετατρέποντας κάθε στιγμή κατανάλωσης σε ένα αξέχαστο ταξίδι γεύσης και αισθητικής, αναδεικνύοντας την τέχνη του καφέ με δίκαιες πρακτικές και αφοσίωση στην ποιότητα.
                    </p>

                    <p class="mt-8 font-medium">
                        Κάλεσμα προς τους Baristi
                    </p>
                    <p>
                        Πιστεύουμε ότι ο ρόλος του barista είναι ο ακρογωνιαίος λίθος της εμπειρίας κατανάλωσης του καφέ. Ενθαρρύνουμε κάθε barista να επιδείξει αφοσίωση και να αγκαλιάσει τη δημιουργική του διάθεση, μετατρέποντας κάθε ρόφημα σε ένα μοναδικό έργο τέχνης. Μαζί, μπορούμε να εμπνεύσουμε τους πελάτες μας και να αναδείξουμε την πραγματική μαγεία που κρύβει ο καφές.
                    </p>

                    <p class="mt-8 font-medium">
                        Οι Αρετές των Baristi του Tailor Made Coffee Roasters
                    </p>
                    <p>
                        <strong>Αξιοπιστία (Reliability):</strong>
                    </p>
                    <p>
                        Συνέπεια: Να παρασκευάζουν κάθε φλιτζάνι καφέ με συνέπεια, ακολουθώντας πιστά τις συνταγές και τις οδηγίες, εξασφαλίζοντας την ίδια γεύση και ποιότητα σε κάθε παραγγελία.
                    </p>
                    <p>
                        Ακρίβεια: Να τηρούν τους χρόνους παρασκευής και παράδοσης, εξασφαλίζοντας γρήγορη και αποτελεσματική εξυπηρέτηση.
                    </p>
                    <p>
                        Εμπιστοσύνη: Να τηρούν τις υποσχέσεις τους και να αντιμετωπίζουν κάθε πελάτη με σεβασμό.
                    </p>

                    <p>
                        <strong>Επικοινωνία (Communication):</strong>
                    </p>
                    <p>
                        Ενημέρωση: Να ενημερώνουν τους πελάτες για τους νέους καφέδες, τις συνταγές και τις προσφορές, προσφέροντας προτάσεις.
                    </p>
                    <p>
                        Ακρόαση: Να ακούν προσεκτικά τις ανάγκες και τις προτιμήσεις των πελατών, προτείνοντας εξατομικευμένες λύσεις.
                    </p>
                    <p>
                        Άμεση Ανταπόκριση: Να απαντούν άμεσα σε ερωτήσεις και ανησυχίες, προσφέροντας λύσεις.
                    </p>

                    <p>
                        <strong>Εξειδίκευση (Expertise):</strong>
                    </p>
                    <p>
                        Γνώση: Να διαθέτουν βαθιά γνώση για τον καφέ, τις ποικιλίες, τις μεθόδους παρασκευής και τα γευστικά χαρακτηριστικά.
                    </p>
                    <p>
                        Επίδειξη: Να επιδεικνύουν τις ικανότητές τους με αυτοπεποίθηση, προσφέροντας συμβουλές και εξηγήσεις.
                    </p>
                    <p>
                        Ενημέρωση: Να παρακολουθούν τις εξελίξεις στον χώρο του καφέ και να ενημερώνονται για τις νέες τάσεις και τεχνικές.
                    </p>

                    <p>
                        <strong>Ευελιξία (Flexibility):</strong>
                    </p>
                    <p>
                        Προσαρμογή: Να προσαρμόζουν τις συνταγές και τις μεθόδους παρασκευής στις ανάγκες και τις προτιμήσεις των πελατών.
                    </p>
                    <p>
                        Δημιουργικότητα: Να είναι δημιουργικοί και να προτείνουν καινοτόμες λύσεις.
                    </p>
                    <p>
                        Αντιμετώπιση Προκλήσεων: Να αντιμετωπίζουν αποτελεσματικά τις προκλήσεις και τις απαιτήσεις των πελατών.
                    </p>

                    <p>
                        <strong>Αξία για τα Χρήματα (Value for Money):</strong>
                    </p>
                    <p>
                        Ποιότητα: Να παρασκευάζουν ροφήματα υψηλής ποιότητας, χρησιμοποιώντας ποιοτικά υλικά και τεχνικές.
                    </p>
                    <p>
                        Εμπειρία: Να δημιουργούν μια μοναδική εμπειρία καφέ για κάθε πελάτη, προσφέροντας όχι απλώς ένα ρόφημα, αλλά μια στιγμή απόλαυσης και χαλάρωσης.
                    </p>
                    <p>
                        Προστιθέμενη Αξία: Να προσφέρουν κάτι παραπάνω από τον απλό καφέ, όπως συμβουλές, πληροφορίες, εξυπηρέτηση με χαμόγελο.
                    </p>

                    <p class="mt-8 font-medium">
                        Ο Barista ως Εμπειρία Καφέ:
                    </p>
                    <p>
                        Οι baristi του Tailor Made Coffee Roasters πρέπει να είναι οι ίδιοι η μοναδική εμπειρία καφέ. Πρέπει να συνδυάζουν τις παραπάνω αρετές με πάθος, ενθουσιασμό και αφοσίωση, δημιουργώντας μια αυθεντική και αξέχαστη εμπειρία για κάθε πελάτη.
                    </p>
                </div>


                <div class="mt-12 flex flex-col items-center gap-4">
                    <p class="text-sm tracking-wider text-neutral-700">
                        SEE THE WORLD THROUGH COFFEE
                    </p>
                    <img 
                        src={image}
                        alt="Tailor Made Logo"
                        class="w-52 h-auto object-contain transition-all duration-300 ease-in-out hover:opacity-20"
                    />
                </div>

                <div class="mt-8 text-right">
                     <p class="text-sm text-neutral-600">Built with passion by our dedicated team</p>
                     <p class="text-sm font-medium text-neutral-700">ⓒ 2025 TAILORMADE TEAM</p>
                </div>
            </div>
        </div>
    </div>
</div>